/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	BaseSound
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	
*
*	修改人:		
*	修改内容:
*********************************************************************/

#pragma once

//==================================================================================================================

namespace FK3DEngine
{
	//--------------------------------------------------------------------------------------------------------------
	//基本声音类
	class BaseSound
	{
	public:
		float			mfVolume;		//声音音量

	public:
		virtual ~BaseSound() = 0;

		//播放声音
		virtual void Play() = 0;

		//停止播放声音
		virtual void Stop() = 0;

		//设置音量
		virtual void SetVolume( float fVolume ) = 0;
	};
	//--------------------------------------------------------------------------------------------------------------

	//--------------------------------------------------------------------------------------------------------------
	//静态声音类
	class StaticSound : virtual public BaseSound
	{
	public:
		DWORD			mdwSoundLen;	//声音数据长度

	public:
		StaticSound();

		//从解码器中载入静态声音
		virtual void LoadStaticSound( SoundDecoder* pSoundDecoder ) = 0;

		//卸载静态声音
		virtual void UnloadStaticSound() = 0;
	};
	//--------------------------------------------------------------------------------------------------------------
	typedef Stack< StaticSound* >	StaticSoundList;
	//--------------------------------------------------------------------------------------------------------------

	//--------------------------------------------------------------------------------------------------------------
	//流式声音类
	class StreamSound : virtual public BaseSound
	{
	protected:
		SoundDecoder*		mpSoundDecoder;

	public:
		StreamSound();

		//载入流式声音
		virtual void LoadStreamSound( SoundDecoder* pSoundDecoder, DWORD dwCacheTime = 2000 ) = 0;

		//卸载流式声音
		virtual void UnloadStreamSound() = 0;
	};
	//--------------------------------------------------------------------------------------------------------------
	typedef Stack< StreamSound* >	StreamSoundList;
	//--------------------------------------------------------------------------------------------------------------
}

//==================================================================================================================
