/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	DS8BaseSound
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	
*
*	修改人:		
*	修改内容:
*********************************************************************/

#pragma once

//==================================================================================================================
struct IDirectSoundBuffer;
//--------------------------------------------------------------------------------------------------------------

namespace FK3DEngine
{
	//--------------------------------------------------------------------------------------------------------------
	// DirectSound 8 基本声音类
	class DS8BaseSound : virtual public BaseSound
	{
	protected:
		IDirectSoundBuffer*		mpSoundBuffer;	//次声音缓存

	public:
		DS8BaseSound();

		//播放声音
		void Play();

		//停止播放声音
		void Stop();

		//设置音量
		void SetVolume( float fVolume );

	protected:
		//创建声音缓存
		void FKFastcall _CreateSoundBuffer( const SoundFormat* pSoundFmt, DWORD dwLength, DWORD dwFlags = 0 );
	};
	//--------------------------------------------------------------------------------------------------------------
}

//==================================================================================================================
