/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	BmpDecoder
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	BMP 图像解码器
*
*	修改人:		
*	修改内容:
*********************************************************************/

#pragma once

//==================================================================================================================

namespace FK3DEngine
{
	//--------------------------------------------------------------------------------------------------------------

	//解析 BMP 图像头
	extern void BmpParseHeader( ImageDecoder* pThis );

	//完成 BMP 图像解码
	extern void BmpEndDecode( ImageDecoder* pThis );

	//解码 BMP 图像数据
	extern void BmpDecode( ImageDecoder* pThis, BYTE* pDstBuf, RECT* srcRect, RECT* dstRect,
		int pitch, PixelFormat ePixelFormat );

	//--------------------------------------------------------------------------------------------------------------
}

//==================================================================================================================
