/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	CollisionRecord
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	碰撞记录类
*
*	修改人:		
*	修改内容:
*********************************************************************/

#pragma once

//==================================================================================================================

namespace FK3DEngine
{
	//--------------------------------------------------------------------------------------------------------------
	//碰撞接触结构
	struct Contact
	{
		Vector3		vNormal;	//接触面法线
		Vector3		vOffset;	//接触点质心偏移量
	};
	typedef Stack< Contact >	ContactStack;
	//--------------------------------------------------------------------------------------------------------------
	//碰撞记录类
	class CollisionRecord
	{
	public:
		bool			mbCollision;		//是否发生碰撞

		float			mCollisionDist;		//最短碰撞距离
		Vector3			mCollisionPos;		//碰撞质心位置

		ContactStack	mContactStack;		//碰撞接触数据堆栈

	public:
		CollisionRecord();

		//增加碰撞接触
		FKInline Contact* AddContact();

		//删除碰撞接触
		FKInline void DelContact( Contact* pContact );

		//删除所有碰撞接触
		FKInline void DelAllContact();
	};
	//--------------------------------------------------------------------------------------------------------------
}

//==================================================================================================================
