/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	RigidSphere
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	刚性球体类
*
*	修改人:		
*	修改内容:
*********************************************************************/

#pragma once

//==================================================================================================================

namespace FK3DEngine
{
	//--------------------------------------------------------------------------------------------------------------
	//刚性球体
	class FK_DLL RigidSphere : public RigidBody
	{
	public:
		float		mRadius;	//球体半径

	public:
		RigidSphere();

		//碰撞体创建函数
		static RigidBody* Creator();

		//设置刚性球体
		void FKFastcall SetRigidSphere( float fRadius );

	protected:
		//更新运动状态
		bool FKFastcall _UpdateMovement();

		//进行碰撞检测
		void FKFastcall _DoCollisionDetect( BoundVolume* pBoundVolume, CollisionInfo* pInfo );
	};
	//--------------------------------------------------------------------------------------------------------------
}

//==================================================================================================================
