/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	BaseTexture
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	
*
*	修改人:		
*	修改内容:
*********************************************************************/

#pragma once

//==================================================================================================================

namespace FK3DEngine
{
	//--------------------------------------------------------------------------------------------------------------
	//纹理基类
	class FK_DLL BaseTexture
	{
	public:
		PixelFormat			mPixelFormat;	//像素格式
		UINT				mNumLevel;		//纹理层级数量
		MemoryPoolMode		mPoolMode;		//纹理内存管理方式
		TextureUsage		mType;			//纹理类型

	public:
		BaseTexture();
		BaseTexture( PixelFormat ePixelFormat, UINT nNumLevel, TextureUsage Type );
		virtual ~BaseTexture() = 0;

		//自动生成多级纹理映射
		virtual void GenerateMipSubLevels( TextureFilterType eFilterType = TFT_LINEAR ) = 0;
	};
	//--------------------------------------------------------------------------------------------------------------
	typedef Stack< BaseTexture* >	BaseTextureList;
	//--------------------------------------------------------------------------------------------------------------
}

//==================================================================================================================
