/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	D3D9BaseTexture
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	D3D9 纹理基类 
*
*	修改人:		
*	修改内容:
*********************************************************************/

#pragma once

//==================================================================================================================

namespace FK3DEngine
{
	//--------------------------------------------------------------------------------------------------------------
	// D3D9 纹理基类
	class FK_DLL D3D9BaseTexture
	{
	public:
		BaseTexture*			mpBaseTexture;	//基类纹理指针
		IDirect3DBaseTexture9*	mpD3D9Texture;	//D3D9 纹理接口

	public:
		D3D9BaseTexture();
		virtual ~D3D9BaseTexture();

		//自动生成多级纹理映射
		void _GenerateMipSubLevels( TextureFilterType eFilterType );

		//根据纹理用途获取纹理内存管理方式和 D3D 纹理用途标识
		DWORD _GetPoolModeAndUsage();
	};
	//--------------------------------------------------------------------------------------------------------------
}

//==================================================================================================================
