/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	D3D9PixelShader
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	D3D9 像素着色器
*
*	修改人:		
*	修改内容:
*********************************************************************/

#pragma once

//==================================================================================================================
struct IDirect3DPixelShader9;
//--------------------------------------------------------------------------------------------------------------

namespace FK3DEngine
{
	//--------------------------------------------------------------------------------------------------------------
	// D3D9 像素着色器
	class FK_DLL D3D9PixelShader : public PixelShader
	{
	protected:
		IDirect3DPixelShader9*		mpD3D9PS;

	public:
		D3D9PixelShader();
		~D3D9PixelShader();

		//构建像素着色器
		void BuildPixelShader();

		//设置像素着色器
		void SetPixelShader();

		//设置像素着色器参数
		void SetPixelShaderParam();

		//释放像素着色器
		void ReleasePixelShader();
	};
	//--------------------------------------------------------------------------------------------------------------
}

//==================================================================================================================
