/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	D3D9VertexDeclaration
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	
*
*	修改人:		
*	修改内容:
*********************************************************************/

#pragma once

//==================================================================================================================

namespace FK3DEngine
{
	//--------------------------------------------------------------------------------------------------------------
	const int nMaxElementNum = 13;		//顶点元素最大数量
	//--------------------------------------------------------------------------------------------------------------
	// D3D9 顶点声明类
	class FK_DLL D3D9VertexDeclaration : public VertexDeclaration
	{
	public:
		IDirect3DVertexDeclaration9*	mpD3D9VertexDeclaration;

	public:
		D3D9VertexDeclaration();
		~D3D9VertexDeclaration();

		//创建顶点声明
		void CreateVertexDeclaration();

		//删除顶点声明
		void ReleaseVertexDeclaration();
	};
	//--------------------------------------------------------------------------------------------------------------
}

//==================================================================================================================
