/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	D3D9VertexShader
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	D3D9 顶点着色器
*
*	修改人:		
*	修改内容:
*********************************************************************/

#pragma once

//==================================================================================================================

namespace FK3DEngine
{
	//--------------------------------------------------------------------------------------------------------------
	// D3D9 顶点着色器
	class FK_DLL D3D9VertexShader : public VertexShader
	{
	protected:
		IDirect3DVertexShader9*		mpD3D9VS;

	public:
		D3D9VertexShader();
		~D3D9VertexShader();

		//构建顶点着色器
		void BuildVertexShader();

		//设置顶点着色器
		void SetVertexShader();

		//设置顶点着色器参数
		void SetVertexShaderParam();

		//释放顶点着色器
		void ReleaseVertexShader();
	};
	//--------------------------------------------------------------------------------------------------------------
}

//==================================================================================================================
