/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	VertexShader
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	
*
*	修改人:		
*	修改内容:
*********************************************************************/

#pragma once

//==================================================================================================================

namespace FK3DEngine
{
	//--------------------------------------------------------------------------------------------------------------
	//顶点着色器
	class FK_DLL VertexShader : public BaseShader
	{
	protected:
		static VertexShader*	mpLastSetVS;	//最后一次设置的顶点着色器指针

	public:
		VertexShader();
		virtual ~VertexShader() = 0;

		//构建顶点着色器
		virtual void BuildVertexShader() = 0;

		//设置顶点着色器
		virtual void SetVertexShader() = 0;

		//设置顶点着色器参数
		virtual void SetVertexShaderParam() = 0;

		//释放顶点着色器
		virtual void ReleaseVertexShader() = 0;
	};
	//--------------------------------------------------------------------------------------------------------------
	typedef Stack< VertexShader* >		VertexShaderList;
	//--------------------------------------------------------------------------------------------------------------
}

//==================================================================================================================
