/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	D3D9BufferManager
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	
*
*	修改人:		
*	修改内容:
*********************************************************************/

#include "../../include/RenderSystem/RenderSystemInsideHeader.h"
#include "../../../Depend/dx9/d3dx9.h"
#include "../../../Depend/dx9/dxerr9.h"
#include "../../include/CommonBase/MemoryMarco.h"

//==================================================================================================================

namespace FK3DEngine
{
	//--------------------------------------------------------------------------------------------------------------
	D3D9BufferManager::D3D9BufferManager()
	{
	}
	//--------------------------------------------------------------------------------------------------------------
	D3D9BufferManager::~D3D9BufferManager()
	{
	}
	//--------------------------------------------------------------------------------------------------------------
	//创建顶点缓存
	VertexBuffer* D3D9BufferManager::AddVertexBuffer()
	{
		VertexBuffer* pVB = new D3D9VertexBuffer;
		*mVBList.Push() = pVB;
		return pVB;
	}
	//--------------------------------------------------------------------------------------------------------------
	//创建索引缓存
	IndexBuffer* D3D9BufferManager::AddIndexBuffer()
	{
		IndexBuffer* pIB = new D3D9IndexBuffer;
		*mIBList.Push() = pIB;
		return pIB;
	}
	//--------------------------------------------------------------------------------------------------------------
	//创建顶点声明
	VertexDeclaration* D3D9BufferManager::AddVertexDeclaration()
	{
		VertexDeclaration* pVD = new D3D9VertexDeclaration;
		*mVDList.Push() = pVD;
		return pVD;
	}
	//--------------------------------------------------------------------------------------------------------------
}

//==================================================================================================================
