/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	D3D9ShaderManager
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	
*
*	修改人:		
*	修改内容:
*********************************************************************/

#include "../../include/RenderSystem/RenderSystemInsideHeader.h"
#include "../../../Depend/dx9/d3dx9.h"
#include "../../../Depend/dx9/dxerr9.h"
#include "../../include/CommonBase/MemoryMarco.h"

//==================================================================================================================

namespace FK3DEngine
{
	//--------------------------------------------------------------------------------------------------------------
	D3D9ShaderManager::D3D9ShaderManager()
	{
	}
	//--------------------------------------------------------------------------------------------------------------
	D3D9ShaderManager::~D3D9ShaderManager()
	{
	}
	//--------------------------------------------------------------------------------------------------------------
	//创建顶点着色器
	VertexShader* D3D9ShaderManager::CreateVertexShader()
	{
		VertexShader* pShader = new D3D9VertexShader;
		*mVSList.Push() = pShader;
		return pShader;
	}
	//--------------------------------------------------------------------------------------------------------------
	//创建像素着色器
	PixelShader* D3D9ShaderManager::CreatePixelShader()
	{
		PixelShader* pShader = new D3D9PixelShader;
		*mPSList.Push() = pShader;
		return pShader;
	}
	//--------------------------------------------------------------------------------------------------------------
}

//==================================================================================================================
