/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	IndexBuffer
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	
*
*	修改人:		
*	修改内容:
*********************************************************************/

#include "../../include/RenderSystem/RenderSystemInsideHeader.h"

//==================================================================================================================

namespace FK3DEngine
{
	//--------------------------------------------------------------------------------------------------------------
	IndexBuffer::IndexBuffer()
		: mnBufLen		(0)
		, mIndexType	(IT_UNKNOWN)
		, mIndexSize	(0)
		, mbDynamic		(false)
	{
	}
	//--------------------------------------------------------------------------------------------------------------
	IndexBuffer::~IndexBuffer()
	{
	}
	//--------------------------------------------------------------------------------------------------------------
	//写入数据到索引缓存
	void IndexBuffer::WriteData( UINT nOffsetNum, void* pData, UINT nIndexNum, bool bNoOverwrite )
	{
		//如果为调试模式则检测指针
#ifdef _DEBUG
		if( pData == NULL )
		{
			Except( Exception::ERR_INVALIDPARAMS, "在写入数据到索引缓存时传入了空的数据指针。" );
			return;
		}
#endif

		//锁定索引缓存
		void* pBuffer = Lock( nOffsetNum, nIndexNum, bNoOverwrite );

		//复制数据
		memcpy( pBuffer, pData, (size_t)nIndexNum * mIndexSize );

		//解锁索引缓存
		Unlock();
	}
	//--------------------------------------------------------------------------------------------------------------
}

//==================================================================================================================
