/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	BSPPlane
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	二叉树分割面
*
*	修改人:		
*	修改内容:
*********************************************************************/

#pragma once

//==================================================================================================================

namespace FK3DEngine
{
	//--------------------------------------------------------------------------------------------------------------
	//二叉树分割面
	class FK_DLL BSPPlane : public Plane3
	{
	public:
		Vector3*	mpVertex;
		bool		mbDivPlane3;

		union
		{
			struct
			{
				WORD mV1;
				WORD mV2;
				WORD mV3;
			};

			WORD mV[3];
		};

	public:
		BSPPlane();
		BSPPlane( Vector3* pVertex, WORD v1, WORD v2, WORD v3 );

		//设置二叉树分割面
		void SetFromPoints( Vector3* pVertex, WORD v1, WORD v2, WORD v3 );

		//判断另一个二叉树分割面与该分割面的空间交错关系
		SpaceRelation FKFastcall GetSide( const BSPPlane& rBSPPlane ) const;
	};
	//--------------------------------------------------------------------------------------------------------------
	typedef Stack< BSPPlane* >		BSPPlaneList;
	//--------------------------------------------------------------------------------------------------------------
}

//==================================================================================================================