/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	QuadSceneNode
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	四叉树场景节点类
*
*	修改人:		
*	修改内容:
*********************************************************************/

#pragma once

//==================================================================================================================

namespace FK3DEngine
{
	//--------------------------------------------------------------------------------------------------------------
	//四叉树场景节点类
	class FK_DLL QuadSceneNode : public SceneNode
	{
	public:
		friend class QuadNode;

	protected:
		QuadNode*		mpQuadNode;		//该场景节点所挂接的四叉树节点

	public:
		QuadSceneNode();
		~QuadSceneNode();

	protected:
		//节点创建函数
		TransformNode* FKFastcall _NodeCreator();

		//通知包围盒已更新
		void FKFastcall _NotifyBoxUpdated();
	};
	//--------------------------------------------------------------------------------------------------------------
	typedef Stack< QuadSceneNode* >		QuadSceneNodeList;
	//--------------------------------------------------------------------------------------------------------------
}

//==================================================================================================================
