/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	ControlInsideHeader
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	
*
*	修改人:		
*	修改内容:
*********************************************************************/

#pragma once

//==================================================================================================================

#pragma comment( lib, "dxguid.lib" )
#pragma comment( lib, "dinput8.lib" )
#pragma comment( lib, "dxerr9.lib" )

//--------------------------------------------------------------------------------------------------------------
#define DIRECTINPUT_VERSION		0x0800
//--------------------------------------------------------------------------------------------------------------

#include "../../../Depend/dinput/dinput.h"
#include "../../../Depend/dx9/dxerr9.h"
#include "../../include/CommonBase/CommonBaseInsideHead.h"
#include "InputSystem.h"
#include "DI8InputSystem.h"

//--------------------------------------------------------------------------------------------------------------