/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	Light
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	灯光类
*
*	修改人:		
*	修改内容:
*********************************************************************/

#pragma once

//==================================================================================================================
#include "../RenderSystem/TypeDefine.h"
//==================================================================================================================

namespace FK3DEngine
{
	//--------------------------------------------------------------------------------------------------------------
	class SceneNode;
	//--------------------------------------------------------------------------------------------------------------
	//灯光类
	class FK_DLL Light
	{
	public:
		LightType		mLightType;		//灯光类型

		ColorValue		mDiffuse;		//漫射色
		ColorValue		mAmbient;		//环境色
		ColorValue		mSpecular;		//高光色

		Vector3			mPosition;		//灯光位置
		Vector3			mDirection;		//灯光方向

		float			mRange;			//灯光范围

		float			mAttenConst;	//常量衰减值
		float			mAttenLinear;	//线性衰减值
		float			mAttenQuad;		//二次方衰减值

		float			mFallOff;		//灯光分散
		float			mTheta;			//聚光灯内角度
		float			mPhi;			//聚光灯外角度


		DWORD			mIndex;			//灯光索引
		bool			mbActived;		//灯光激活标志
		bool			mbEnable;		//灯光开启标志
		
		SceneNode*		mpAttachedNode;	//该灯光连接的节点

	public:
		Light();
		~Light();

		//将该灯光从它所连接的节点上断开
		void DetachFromNode();

		//激活灯光
		void ActiveLight( const bool bActive = true );

		//开启/关闭灯光
		void EnableLight( const bool bEnable = true );
	};
	//--------------------------------------------------------------------------------------------------------------
	typedef Stack< Light* >	LightList;
	//--------------------------------------------------------------------------------------------------------------
}

//==================================================================================================================
