/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	RenderGroup
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	渲染组类
*
*	修改人:		
*	修改内容:
*********************************************************************/

#pragma once

//==================================================================================================================

namespace FK3DEngine
{
	//--------------------------------------------------------------------------------------------------------------
	//渲染组类
	class FK_DLL RenderGroup
	{
	public:
		UINT				mnPriority;			//渲染组优先级

		RenderUnit*			mpHeadRenderUnit;	//起始渲染单元
		RenderUnit*			mpRearRenderUnit;	//结尾渲染单元

	public:
		//排序渲染组
		void SortRenderGroup( RenderSubGroupStack* pRenderSubGroupStack, const Camera* pCamera  );
	};
	//--------------------------------------------------------------------------------------------------------------
	typedef Stack< RenderGroup >	RenderGroupStack;
	//--------------------------------------------------------------------------------------------------------------
}

//==================================================================================================================
