/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	Skeleton
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	骨骼类
*
*	修改人:		
*	修改内容:
*********************************************************************/

#pragma once

//==================================================================================================================

namespace FK3DEngine
{
	//--------------------------------------------------------------------------------------------------------------
	typedef Stack< Matrix4Stack* >	BoneMatList;
	//--------------------------------------------------------------------------------------------------------------
	//骨骼类
	class FK_DLL Skeleton
	{
	public:
		UINT			mNumKey;			//帧数量
		float			mIntervalTime;		//每帧的停顿时间

		UINT			mNumBones;			//骨头数量
		BoneMatList		mBoneMatList;		//骨头矩阵数据列表

	public:
		Skeleton( UINT nNumKey, float fIntervalTime );
		~Skeleton();

		//创建骨头
		void CreateBone( const Matrix4* pBoneKeyMatrix );

		//删除骨头
		void DeleteBone( UINT nBoneIndex );

		//删除所有骨头
		void DeleteAllBones();

		//设置帧数量
		void SetKeyNumber( UINT nNumKey );

		//设置停顿时间
		void SetIntervalTime( float fIntervalTime );
	};
	//--------------------------------------------------------------------------------------------------------------
	typedef Stack< Skeleton* >		SkeletonList;
	//--------------------------------------------------------------------------------------------------------------
}

//==================================================================================================================
