/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	UVAFileFormat
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	UV 纹理动画数据格式
*
*	修改人:		
*	修改内容:
*********************************************************************/

#pragma once

//==================================================================================================================

namespace FK3DEngine
{
	//--------------------------------------------------------------------------------------------------------------
	#pragma pack ( push )
	#pragma pack ( 4 )
	//--------------------------------------------------------------------------------------------------------------

	// UVA 文件头信息
	struct UVAHeader
	{
		LONG	nVersion;		//文件版本
		int		nSegment;		//动画段数量
		int		nFrames;		//动画总帧数

		UINT	nTexWidth;		//动画纹理宽度
		UINT	nTexHeight;		//动画纹理高度
	};

	//四浮点值纹理 UV 坐标结构
	struct UV4
	{
		float u1;	//左
		float u2;	//右
		float v1;	//上
		float v2;	//下
	};
	typedef Stack< UV4 >		UV4Stack;

	// UV 动画数据分段
	struct UVASegment
	{
		int Begin;	//起始帧数
		int End;	//结束帧数
	};
	typedef Stack< UVASegment >	UVASegmentStack;

	// UV 动画帧
	struct UVAFrame
	{
		UV4		sUV4;		//纹理坐标
		float	fFrameTime;	//帧延时
	};
	typedef Stack< UVAFrame >	UVAFrameStack;

	//--------------------------------------------------------------------------------------------------------------
	#pragma pack ( pop )
	//--------------------------------------------------------------------------------------------------------------
}

//==================================================================================================================
