/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	ViewFrustum
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	视体
*
*	修改人:		
*	修改内容:
*********************************************************************/

#pragma once

//==================================================================================================================

namespace FK3DEngine
{
	//--------------------------------------------------------------------------------------------------------------
	//视体
	class FK_DLL ViewFrustum
	{
	public:
		Vector3		mVertex3[8];	//视体的八个顶点
		Plane3		mPlane3[6];		//视体的六个面

	protected:
		Vector3		mOriVertex[8];	//视体的原始顶点坐标

	public:
		ViewFrustum();

		//更新视体
		void UpdateViewFrustum( const Matrix4& ViewProjMatrix );

        //检测指定包围盒顶点是否与视体相交
		bool IsIntersect( const Vector3 pBoxVer[8] );
	};
	//--------------------------------------------------------------------------------------------------------------
}

//==================================================================================================================
