/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	Directories
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	
*
*	修改人:		
*	修改内容:
*********************************************************************/

#pragma once

//--------------------------------------------------------------------
#include <string>
//--------------------------------------------------------------------
namespace FK2DEngine
{
	//! 一个程序自己的资源目录
	std::wstring ResourcePrefix();
	//! 一个程序组的资源目录
	std::wstring ShareResourcePrefix();
	//! 用户配置的目录
	std::wstring UserSettingPrefix();
	//! 用户文档目录( 例如：用户保存的数据 )
	std::wstring UserDocsPrefix();
}