/********************************************************************
*
*	本文件是FKMMORPG的一部分。本文件版权归属FreeKnightDuzhi(王宏张)所有。
*	E-mail: duzhi5368@163.com
*	QQ: 	281862942
* 	
*	-----------------------------------------------------------------
*
*	文件名：	System
*	作者：		FreeKnightDuzhi[ 王宏张 ]
*	文件说明：	
*
*	修改人:		
*	修改内容:
*********************************************************************/

#pragma once

//--------------------------------------------------------------------
namespace FK2DEngine
{
	namespace System
	{
		//--------------------------------------------------------------------
		//! 检测CPU是否支持MMX指令
		bool IsCpuSupportMMX();

		//! 开启Debug版的内存泄漏检测
		void EnableMemoryLeakCheck();

		//! 检测DirectX版本是否在8以上
		bool CheckDXVersion8();
		//--------------------------------------------------------------------
	}
}